[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:25:17
 
         public static void ValidateLength(string value, int minimun, int maximun, string message)
         {
-            if (value.Length < minimun || value.Length > maximun)
+            if (value.Length > minimun || value.Length > maximun)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.InsertInvoiceServiceTests.ExecuteAsync_Success; Flight.Domain.Tests.Products.Entity.ProductTests.Product_WithNameMinimunLength_RequiredException

[Killed] Negate expression
Flight/Flight.Domain/Common/ArgumentValidator.cs:33:17
 
         public static void ValidateGreaterThanZero(decimal value, string message)
         {
-            if (value <= 0)
+            if (!(value <= 0))
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException
