[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:18:17
             get => _name;
             set
             {
-                ArgumentValidator.ValidateRequired(value, "the name should not be null or empty.");
+                ;
                 ArgumentValidator.ValidateLength(value, MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
                 _name = value;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameNull_RequiredException

[Killed] String mutation
Flight.Domain/Customers/Entity/Customer.cs:18:59
             get => _name;
             set
             {
-                ArgumentValidator.ValidateRequired(value, "the name should not be null or empty.");
+                ArgumentValidator.ValidateRequired(value, "");
                 ArgumentValidator.ValidateLength(value, MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
                 _name = value;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameNull_RequiredException

[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:19:17
             set
             {
                 ArgumentValidator.ValidateRequired(value, "the name should not be null or empty.");
-                ArgumentValidator.ValidateLength(value, MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
+                ;
                 _name = value;
             }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameLength_RequiredException

[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:29:17
             get => _typeCustomer;
             set
             {
-                ArgumentValidator.ValidateEnum(value, "the customer type is not valid.");
+                ;
                 _typeCustomer = value;
             }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithTypeInvalid_RequiredException
