[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:21:17
             get => _customer;
             set
             {
-                ArgumentValidator.ValidateNull(value, "the customer should not be null.");
+                ;
                 _customer = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException

[Killed] String mutation
Invoices/Model/Entity/Invoice.cs:21:55
             get => _customer;
             set
             {
-                ArgumentValidator.ValidateNull(value, "the customer should not be null.");
+                ArgumentValidator.ValidateNull(value, "");
                 _customer = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:31:17
             get => _productsInvoice;
             set
             {
-                ArgumentValidator.ValidateNull(value, "the products should not be null.");
+                ;
                 ArgumentValidator.ValidateNotEmpty(value, "the products should not be empty.");
                 _productsInvoice = value;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceNull_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:32:17
             set
             {
                 ArgumentValidator.ValidateNull(value, "the products should not be null.");
-                ArgumentValidator.ValidateNotEmpty(value, "the products should not be empty.");
+                ;
                 _productsInvoice = value;
                 ValueTotal = CalculateValueTotal();
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceEmpty_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:46:17
             get => _state;
             set
             {
-                ArgumentValidator.ValidateEnum(value, "the invoice state is not valid.");
+                ;
                 _state = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithStateInvalid_RequiredException
