[Killed] Statement mutation
Invoices/Model/Entity/ProductInvoice.cs:19:17
             get => _quantity;
             set
             {
-                ArgumentValidator.ValidateGreaterThanZero(value, "the quantity should be greater than zero.");
+                ;
                 _quantity = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithQuantityZero_RequiredException

[Killed] String mutation
Invoices/Model/Entity/ProductInvoice.cs:19:66
             get => _quantity;
             set
             {
-                ArgumentValidator.ValidateGreaterThanZero(value, "the quantity should be greater than zero.");
+                ArgumentValidator.ValidateGreaterThanZero(value, "");
                 _quantity = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithQuantityZero_RequiredException

[NoCoverage] Statement mutation
Invoices/Model/Entity/ProductInvoice.cs:29:17
             get => _invoice;
             set
             {
-                ArgumentValidator.ValidateNull(value, "the invoice should not be null.");
+                ;
                 _invoice = value;
             }

[Killed] Statement mutation
Invoices/Model/Entity/ProductInvoice.cs:39:17
             get => _product;
             set
             {
-                ArgumentValidator.ValidateNull(value, "the product should not be null.");
+                ;
                 _product = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithproductNull_RequiredException
