[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:12:13
         public async Task ExecuteAsync(Guid id)
         {
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
-            ArgumentValidator.ValidateNull(invoice, "the invoice not exist.");
+            ;
             invoice.IsCancel();
             invoice.Cancel();
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:13:13
         {
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
             ArgumentValidator.ValidateNull(invoice, "the invoice not exist.");
-            invoice.IsCancel();
+            ;
             invoice.Cancel();
             invoiceRepository.Update(invoice);
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException

[Survived] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:16:13
             invoice.IsCancel();
             invoice.Cancel();
             invoiceRepository.Update(invoice);
-            await Task.CompletedTask;
+            ;
         }
     }
