[Killed] Statement mutation
Flight.Domain/Products/Entity/Product.cs:31:17
             get => _value;
             set
             {
-                ArgumentValidator.ValidateGreaterThanZero(value, "the value should be greater than zero.");
+                ;
                 _value = value;
             }
killedBy: Flight.Domain.Tests.Products.Entity.ProductTests.Product_WithValueZero_RequiredException
