[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:9:26
     {
         public static object ValidateNull(this object value, string message)
         {
-            if (value is null)
+            if (value is not null)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.InsertInvoiceServiceTests.ExecuteAsync_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success

[Killed] Statement mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:11:17
         {
             if (value is null)
             {
-                throw new RequiredException(message);
+                ;
             }
             return value;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceNull_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] Negate expression
Flight/Flight.Domain/Common/ArgumentValidator.cs:18:17
 
         public static string ValidateRequired(this string value, string message)
         {
-            if (string.IsNullOrEmpty(value))
+            if (!(string.IsNullOrEmpty(value)))
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] String mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:18:17
 
         public static string ValidateRequired(this string value, string message)
         {
-            if (string.IsNullOrEmpty(value))
+            if ((value!=""))
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:27:43
 
         public static string ValidateLength(this string value, int minimun, int maximun, string message)
         {
-            if (value.Length < minimun || value.Length > maximun)
+            if (value.Length < minimun || value.Length < maximun)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException

[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:27:17
 
         public static string ValidateLength(this string value, int minimun, int maximun, string message)
         {
-            if (value.Length < minimun || value.Length > maximun)
+            if (value.Length <= minimun || value.Length > maximun)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.InsertInvoiceServiceTests.ExecuteAsync_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success

[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:36:17
 
         public static decimal ValidateGreaterThanZero(this decimal value, string message)
         {
-            if (value <= 0)
+            if (value > 0)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success

[Killed] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:36:17
 
         public static decimal ValidateGreaterThanZero(this decimal value, string message)
         {
-            if (value <= 0)
+            if (value < 0)
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithQuantityZero_RequiredException; Flight.Domain.Tests.Products.Entity.ProductTests.Product_WithValueZero_RequiredException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:45:17
 
         public static TEnum ValidateEnum<TEnum>(this TEnum value, string message) where TEnum : struct, Enum
         {
-            if (!Enum.IsDefined(value))
+            if (Enum.IsDefined(value))
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:54:17
 
         public static IEnumerable<T> ValidateNotEmpty<T>(this IEnumerable<T> list, string message)
         {
-            if (!list.Any())
+            if (list.Any())
             {
                 throw new RequiredException(message);
killedBy: Flight.Domain.Tests.Invoices.Service.InsertInvoiceServiceTests.ExecuteAsync_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success

[NoCoverage] Equality mutation
Flight/Flight.Domain/Common/ArgumentValidator.cs:63:17
 
         public static Guid ValidateNotEmpty(this Guid value, string message)
         {
-            if (value == Guid.Empty)
+            if (value != Guid.Empty)
             {
                 throw new RequiredException(message);
