[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:18:17
             get => _name;
             set
             {
-                value.ValidateRequired("the name should not be null or empty.");
+                ;
                 value.ValidateLength(MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
                 _name = value;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameNull_RequiredException

[Killed] String mutation
Flight.Domain/Customers/Entity/Customer.cs:18:40
             get => _name;
             set
             {
-                value.ValidateRequired("the name should not be null or empty.");
+                value.ValidateRequired("");
                 value.ValidateLength(MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
                 _name = value;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameNull_RequiredException

[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:19:17
             set
             {
                 value.ValidateRequired("the name should not be null or empty.");
-                value.ValidateLength(MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
+                ;
                 _name = value;
             }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameLength_RequiredException

[Killed] String mutation
Flight.Domain/Customers/Entity/Customer.cs:19:76
             set
             {
                 value.ValidateRequired("the name should not be null or empty.");
-                value.ValidateLength(MinimunLengthName, MaximunLengthName, $"the name should be between {MinimunLengthName} and {MaximunLengthName} characters.");
+                value.ValidateLength(MinimunLengthName, MaximunLengthName, $"");
                 _name = value;
             }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithNameLength_RequiredException

[Killed] Statement mutation
Flight.Domain/Customers/Entity/Customer.cs:29:17
             get => _typeCustomer;
             set
             {
-                value.ValidateEnum("the customer type is not valid.");
+                ;
                 _typeCustomer = value;
             }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_WithTypeInvalid_RequiredException

[Killed] Equality mutation
Flight.Domain/Customers/Entity/Customer.cs:34:41
             }
         }
 
-        public bool IsPreferential() => TypeCustomer == TypeCustomer.Preferential;
+        public bool IsPreferential() => TypeCustomer != TypeCustomer.Preferential;
 
         public bool IsCommon() => TypeCustomer == TypeCustomer.Common;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_IsPreferential_True

[Killed] Equality mutation
Flight.Domain/Customers/Entity/Customer.cs:36:35
 
         public bool IsPreferential() => TypeCustomer == TypeCustomer.Preferential;
 
-        public bool IsCommon() => TypeCustomer == TypeCustomer.Common;
+        public bool IsCommon() => TypeCustomer != TypeCustomer.Common;
 
         public bool IsSpecial() => TypeCustomer == TypeCustomer.Special;
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_IsCommon_True; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_Success

[Killed] Equality mutation
Flight.Domain/Customers/Entity/Customer.cs:38:36
 
         public bool IsCommon() => TypeCustomer == TypeCustomer.Common;
 
-        public bool IsSpecial() => TypeCustomer == TypeCustomer.Special;
+        public bool IsSpecial() => TypeCustomer != TypeCustomer.Special;
     }
 }
killedBy: Flight.Domain.Tests.Customers.Entity.CustomerTests.Customer_IsSpecial_True
