[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:21:17
             get => _customer;
             set
             {
-                value.ValidateNull("the customer should not be null.");
+                ;
                 _customer = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithCustomerNull_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:31:17
             get => _productsInvoice;
             set
             {
-                value.ValidateNull("the products should not be null.");
+                ;
                 value.ValidateNotEmpty("the products should not be empty.");
                 _productsInvoice = value;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceNull_RequiredException

[Killed] String mutation
Invoices/Model/Entity/Invoice.cs:31:36
             get => _productsInvoice;
             set
             {
-                value.ValidateNull("the products should not be null.");
+                value.ValidateNull("");
                 value.ValidateNotEmpty("the products should not be empty.");
                 _productsInvoice = value;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceNull_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:32:17
             set
             {
                 value.ValidateNull("the products should not be null.");
-                value.ValidateNotEmpty("the products should not be empty.");
+                ;
                 _productsInvoice = value;
                 ValueTotal = CalculateValueTotal();
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceEmpty_RequiredException

[Killed] String mutation
Invoices/Model/Entity/Invoice.cs:32:40
             set
             {
                 value.ValidateNull("the products should not be null.");
-                value.ValidateNotEmpty("the products should not be empty.");
+                value.ValidateNotEmpty("");
                 _productsInvoice = value;
                 ValueTotal = CalculateValueTotal();
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithProductsInvoiceEmpty_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:35:17
                 value.ValidateNotEmpty("the products should not be empty.");
                 _productsInvoice = value;
                 ValueTotal = CalculateValueTotal();
-                ApplyDiscount();
+                ;
             }
         }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:46:17
             get => _state;
             set
             {
-                value.ValidateEnum("the invoice state is not valid.");
+                ;
                 _state = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_WithStateInvalid_RequiredException

[Killed] Equality mutation
Invoices/Model/Entity/Invoice.cs:53:17
 
         public void IsCancel()
         {
-            if (State == InvoiceState.Canceled)
+            if (State != InvoiceState.Canceled)
             {
                 throw new CoreBusinessException("the invoice is already canceled.");
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_Success

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:55:17
         {
             if (State == InvoiceState.Canceled)
             {
-                throw new CoreBusinessException("the invoice is already canceled.");
+                ;
             }
         }
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException

[Killed] Negate expression
Invoices/Model/Entity/Invoice.cs:61:17
 
         public void Cancel()
         {
-            if (Customer.IsCommon())
+            if (!(Customer.IsCommon()))
             {
                 throw new CoreBusinessException("you cannot cancel the invoice of a common customer.");
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_Success

[Killed] Statement mutation
Invoices/Model/Entity/Invoice.cs:63:17
         {
             if (Customer.IsCommon())
             {
-                throw new CoreBusinessException("you cannot cancel the invoice of a common customer.");
+                ;
             }
             State = InvoiceState.Canceled;
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException

[Killed] String mutation
Invoices/Model/Entity/Invoice.cs:63:49
         {
             if (Customer.IsCommon())
             {
-                throw new CoreBusinessException("you cannot cancel the invoice of a common customer.");
+                throw new CoreBusinessException("");
             }
             State = InvoiceState.Canceled;
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException

[Killed] Arithmetic mutation
Invoices/Model/Entity/Invoice.cs:72:46
         {
             var discount = Customer.TypeCustomer switch
             {
-                TypeCustomer.Preferential => ValueTotal * DiscountCustomerPreferential,
+                TypeCustomer.Preferential => ValueTotal / DiscountCustomerPreferential,
                 TypeCustomer.Special => ValueTotal * DiscountCustomerSpecial,
                 _ => 0
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] Arithmetic mutation
Invoices/Model/Entity/Invoice.cs:73:41
             var discount = Customer.TypeCustomer switch
             {
                 TypeCustomer.Preferential => ValueTotal * DiscountCustomerPreferential,
-                TypeCustomer.Special => ValueTotal * DiscountCustomerSpecial,
+                TypeCustomer.Special => ValueTotal / DiscountCustomerSpecial,
                 _ => 0
             };
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
Invoices/Model/Entity/Invoice.cs:76:13
                 TypeCustomer.Special => ValueTotal * DiscountCustomerSpecial,
                 _ => 0
             };
-            ValueTotal -= discount;
+            ValueTotal += discount;
         }
 
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Invoices/Model/Entity/Invoice.cs:84:17
             decimal total = 0;
             foreach (var product in ProductsInvoice)
             {
-                total += product.CalculateTotalWithIva();
+                total -= product.CalculateTotalWithIva();
             }
             return total;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success
