[Killed] Statement mutation
Invoices/Model/Entity/ProductInvoice.cs:18:17
             get => _quantity;
             set
             {
-                value.ValidateGreaterThanZero("the quantity should be greater than zero.");
+                ;
                 _quantity = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithQuantityZero_RequiredException

[Killed] String mutation
Invoices/Model/Entity/ProductInvoice.cs:18:47
             get => _quantity;
             set
             {
-                value.ValidateGreaterThanZero("the quantity should be greater than zero.");
+                value.ValidateGreaterThanZero("");
                 _quantity = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithQuantityZero_RequiredException

[Killed] Statement mutation
Invoices/Model/Entity/ProductInvoice.cs:30:17
             get => _product;
             set
             {
-                value.ValidateNull("the product should not be null.");
+                ;
                 _product = value;
             }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.ProductInvoiceTests.ProductInvoice_WithProductNull_RequiredException

[Killed] Arithmetic mutation
Invoices/Model/Entity/ProductInvoice.cs:35:51
             }
         }
 
-        public decimal CalculateTotalWithIva() => CalculateSubTotal() + CalculateIva();
+        public decimal CalculateTotalWithIva() => CalculateSubTotal() - CalculateIva();
 
         private decimal CalculateIva()
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] Negate expression
Invoices/Model/Entity/ProductInvoice.cs:40:17
         private decimal CalculateIva()
         {
             decimal ivaCalculate = 0;
-            if (Product.ApplyIva)
+            if (!(Product.ApplyIva))
             {
                 ivaCalculate = CalculateSubTotal() * ValueIva;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] Arithmetic mutation
Invoices/Model/Entity/ProductInvoice.cs:42:32
             decimal ivaCalculate = 0;
             if (Product.ApplyIva)
             {
-                ivaCalculate = CalculateSubTotal() * ValueIva;
+                ivaCalculate = CalculateSubTotal() / ValueIva;
             }
             return ivaCalculate;
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success

[Killed] Arithmetic mutation
Invoices/Model/Entity/ProductInvoice.cs:47:48
             return ivaCalculate;
         }
 
-        private decimal CalculateSubTotal() => Product.Value * Quantity;
+        private decimal CalculateSubTotal() => Product.Value / Quantity;
 
     }
killedBy: Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsSpecial_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsCommun_Success; Flight.Domain.Tests.Invoices.Model.Entity.InvoiceTests.Invoice_CustomerIsPreferential_Success
