[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:12:13
         public async Task ExecuteAsync(Guid id)
         {
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
-            invoice.ValidateNull("the invoice not exist.");
+            ;
             invoice.IsCancel();
             invoice.Cancel();
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] String mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:12:34
         public async Task ExecuteAsync(Guid id)
         {
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
-            invoice.ValidateNull("the invoice not exist.");
+            invoice.ValidateNull("");
             invoice.IsCancel();
             invoice.Cancel();
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceNotExist_RequiredException

[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:13:13
         {
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
             invoice.ValidateNull("the invoice not exist.");
-            invoice.IsCancel();
+            ;
             invoice.Cancel();
             invoiceRepository.Update(invoice);
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_InvoiceIsCacel_RequiredException

[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:14:13
             var invoice = await invoiceRepository.GetByIdAsync(id, nameof(Customers.Entity.Customer));
             invoice.ValidateNull("the invoice not exist.");
             invoice.IsCancel();
-            invoice.Cancel();
+            ;
             invoiceRepository.Update(invoice);
         }
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_CustomerIsCommon_RequiredException; Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_Success

[Killed] Statement mutation
Flight.Domain/Invoices/Service/CancelInvoiceService.cs:15:13
             invoice.ValidateNull("the invoice not exist.");
             invoice.IsCancel();
             invoice.Cancel();
-            invoiceRepository.Update(invoice);
+            ;
         }
     }
killedBy: Flight.Domain.Tests.Invoices.Service.CancelInvoiceServiceTests.ExecuteAsync_Success
