[Killed] Block removal mutation
Flight.Domain/Invoices/Service/InsertInvoiceService.cs:11:9
     public class InsertInvoiceService(IInvoiceRepository invoiceRepository)
     {
         public async Task<Guid> ExecuteAsync(Invoice invoice)
-        {
-            var invoiceId = await invoiceRepository.AddAsync(invoice);
-
-            return invoiceId;
-        }
+        {}
     }
 }
killedBy: Flight.Domain.Tests.Invoices.Service.InsertInvoiceServiceTests.ExecuteAsync_Success
