[Killed] Statement mutation
Flight.Domain/Products/Entity/Product.cs:31:17
             get => _value;
             set
             {
-                value.ValidateGreaterThanZero("the value should be greater than zero.");
+                ;
                 _value = value;
             }
killedBy: Flight.Domain.Tests.Products.Entity.ProductTests.Product_WithValueZero_RequiredException

[Killed] String mutation
Flight.Domain/Products/Entity/Product.cs:31:47
             get => _value;
             set
             {
-                value.ValidateGreaterThanZero("the value should be greater than zero.");
+                value.ValidateGreaterThanZero("");
                 _value = value;
             }
killedBy: Flight.Domain.Tests.Products.Entity.ProductTests.Product_WithValueZero_RequiredException

[NoCoverage] Block removal mutation
Flight.Domain/Products/Entity/Product.cs:37:9
         }
 
         public void Update(string name, bool applyIva, decimal value)
-        {
-            Name = name;
-            ApplyIva = applyIva;
-            Value = value;
-        }
+        {}
     }
 }
